2024.08.20.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2024.08.13.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2024.08.27.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of August 13 to 20, 2024.

#+TOC: headlines 1


* MlFront - A Java-like package system for OCaml
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-mlfront-a-java-like-package-system-for-ocaml/15072/8

** jbeckford announced


There is now a new library ~MlFront_Top~ with a build tool ~mlfront-top~ that will generate self-contained OCaml toplevel script files with parallelism based on @c-cube's moonpool library:

#+begin_example
  .
  ├── AcmeWidgets_Std/
  │   ├── JobsA1.ml
  │   └── JobsA2.ml
  └── BobBuilder_Std/
      └── JobsB.ml
#+end_example

#+begin_example
$ mlfront-top -o buildscript.ml

$ ocaml buildscript.ml -j 2 -native
  legend: -> start | <- finish
     directory create: target/
     file create: target/AcmeWidgets_Std.ml
     link create: AcmeWidgets_Std/JobsA1.ml -> target/AcmeWidgets_Std__JobsA1.ml
     link create: AcmeWidgets_Std/JobsA2.ml -> target/AcmeWidgets_Std__JobsA2.ml
     link create: BobBuilder_Std/JobsB.ml -> target/BobBuilder_Std__JobsB.ml
  -> compile: AcmeWidgets_Std.JobsA1
  -> compile: AcmeWidgets_Std.JobsA2
  <- compile: AcmeWidgets_Std.JobsA1
  <- compile: AcmeWidgets_Std.JobsA2
  -> compile: AcmeWidgets_Std
  <- compile: AcmeWidgets_Std
  -> compile: BobBuilder_Std.JobsB
  <- compile: BobBuilder_Std.JobsB
  -> executable create: BobBuilder_Std.JobsB
  <- executable create: BobBuilder_Std.JobsB
  done.

$ target/BobBuilder_Std.JobsB
I am an A1!
I am an A2!
I am a B!
#+end_example

It requires the ~ocaml~ binary and ~ocamlc~ or ~ocamlopt~. The complete example is at https://gitlab.com/dkml/build-tools/MlFront/-/blob/0.4.0-6/tests/MlFront_Top/jobs.t/run.t.
      



* Rpmfile library v0.3.0 with new Eio-based reader
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/rpmfile-library-v0-3-0-with-new-eio-based-reader/15149/1

** Mikhail announced


Today I want to tell you about new version of [[https://github.com/dx3mod/rpmfile][Rpmfile library]]. Rpmfile is a library for reading metadata from [[https://en.wikipedia.org/wiki/RPM_Package_Manager][RPM]] packages. Originally Rpmfile's parser (reader) used [[https://github.com/inhabitedtype/angstrom][Angstrom]] for parsing. And in the new release added new modern [[https://github.com/ocaml-multicore/eio][Eio]]-based reader. 

Globally, the project is now split into four packages: ~rpmfile~, which contains signatures and implementation-independent functions, ~rpmfile-unix~ with the original Angstrom parser, and ~rpmfile-eio~ (with ~rpmfile-cli~) written using Eio.

*** My experience porting to Eio 

Eio is a fantastic effect-based I/O library for a more modern age in multicore OCaml. I think it takes the best ideas from the ecosystem. So built-in ~Buf_read~ and ~Buf_write~ modules implement ideas from Angstrom and Faraday libraries. Almost API one-to-one, allowing porting via copy-paste. 

But, of course, not everything is so perfect. Unlike the ~Angstrom.parse_~ function, the ~Buf_read.parse~ function thinks I want to read a whole stream to end of input.

A snippet of the source code:
#+begin_src ocaml
let parse ?initial_size ~max_size p flow =
  let buf = of_flow flow ?initial_size ~max_size in
  format_errors (p <* end_of_input) buf
  (*               ^^^^^^^^^^^^^^^           
                    0_0 nice (not)        *)
#+end_src

So I had to rewrite this function myself in a form similar to ~Angstrom.Consume.Prefix~.

