2024.08.20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-20 Tue 11:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2024.08.13.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2024.08.27.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of August 13 to 20, 2024.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">MlFront - A Java-like package system for OCaml</a></li>
<li><a href="#2">Rpmfile library v0.3.0 with new Eio-based reader</a></li>
<li><a href="#3">GitHub - meta-introspector/ocaml-libppx-import-yojson-introspector: Using libppx, ppx_import, reflect over ast using</a></li>
<li><a href="#4">Dune Developer Preview Updates</a></li>
<li><a href="#5">Ppxlib dev meetings</a></li>
<li><a href="#6">Pragmatic Category Theory: Part 2 published!</a></li>
<li><a href="#7">Dune dev meeting on 2024-08-21, 10am CEST</a></li>
<li><a href="#8">Other OCaml News</a></li>
<li><a href="#orgae87327">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">MlFront - A Java-like package system for OCaml</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mlfront-a-java-like-package-system-for-ocaml/15072/8">https://discuss.ocaml.org/t/ann-mlfront-a-java-like-package-system-for-ocaml/15072/8</a>
</p>
</div>

<div id="outline-container-org5977201" class="outline-3">
<h3 id="org5977201">jbeckford announced</h3>
<div class="outline-text-3" id="text-org5977201">
<p>
There is now a new library <code>MlFront_Top</code> with a build tool <code>mlfront-top</code> that will generate self-contained OCaml toplevel script files with parallelism based on @c-cube's moonpool library:
</p>

<pre class="example" id="org63c6e9a">
.
├── AcmeWidgets_Std/
│   ├── JobsA1.ml
│   └── JobsA2.ml
└── BobBuilder_Std/
    └── JobsB.ml
</pre>

<pre class="example" id="org802d528">
$ mlfront-top -o buildscript.ml

$ ocaml buildscript.ml -j 2 -native
  legend: -&gt; start | &lt;- finish
     directory create: target/
     file create: target/AcmeWidgets_Std.ml
     link create: AcmeWidgets_Std/JobsA1.ml -&gt; target/AcmeWidgets_Std__JobsA1.ml
     link create: AcmeWidgets_Std/JobsA2.ml -&gt; target/AcmeWidgets_Std__JobsA2.ml
     link create: BobBuilder_Std/JobsB.ml -&gt; target/BobBuilder_Std__JobsB.ml
  -&gt; compile: AcmeWidgets_Std.JobsA1
  -&gt; compile: AcmeWidgets_Std.JobsA2
  &lt;- compile: AcmeWidgets_Std.JobsA1
  &lt;- compile: AcmeWidgets_Std.JobsA2
  -&gt; compile: AcmeWidgets_Std
  &lt;- compile: AcmeWidgets_Std
  -&gt; compile: BobBuilder_Std.JobsB
  &lt;- compile: BobBuilder_Std.JobsB
  -&gt; executable create: BobBuilder_Std.JobsB
  &lt;- executable create: BobBuilder_Std.JobsB
  done.

$ target/BobBuilder_Std.JobsB
I am an A1!
I am an A2!
I am a B!
</pre>

<p>
It requires the <code>ocaml</code> binary and <code>ocamlc</code> or <code>ocamlopt</code>. The complete example is at <a href="https://gitlab.com/dkml/build-tools/MlFront/-/blob/0.4.0-6/tests/MlFront_Top/jobs.t/run.t">https://gitlab.com/dkml/build-tools/MlFront/-/blob/0.4.0-6/tests/MlFront_Top/jobs.t/run.t</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Rpmfile library v0.3.0 with new Eio-based reader</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/rpmfile-library-v0-3-0-with-new-eio-based-reader/15149/1">https://discuss.ocaml.org/t/rpmfile-library-v0-3-0-with-new-eio-based-reader/15149/1</a>
</p>
</div>

<div id="outline-container-org384f3e0" class="outline-3">
<h3 id="org384f3e0">Mikhail announced</h3>
<div class="outline-text-3" id="text-org384f3e0">
<p>
Today I want to tell you about new version of <a href="https://github.com/dx3mod/rpmfile">Rpmfile library</a>. Rpmfile is a library for reading metadata from <a href="https://en.wikipedia.org/wiki/RPM_Package_Manager">RPM</a> packages. Originally Rpmfile's parser (reader) used <a href="https://github.com/inhabitedtype/angstrom">Angstrom</a> for parsing. And in the new release added new modern <a href="https://github.com/ocaml-multicore/eio">Eio</a>-based reader. 
</p>

<p>
Globally, the project is now split into four packages: <code>rpmfile</code>, which contains signatures and implementation-independent functions, <code>rpmfile-unix</code> with the original Angstrom parser, and <code>rpmfile-eio</code> (with <code>rpmfile-cli</code>) written using Eio.
</p>
</div>

<div id="outline-container-org0acb77c" class="outline-4">
<h4 id="org0acb77c">My experience porting to Eio</h4>
<div class="outline-text-4" id="text-org0acb77c">
<p>
Eio is a fantastic effect-based I/O library for a more modern age in multicore OCaml. I think it takes the best ideas from the ecosystem. So built-in <code>Buf_read</code> and <code>Buf_write</code> modules implement ideas from Angstrom and Faraday libraries. Almost API one-to-one, allowing porting via copy-paste. 
</p>

<p>
But, of course, not everything is so perfect. Unlike the <code>Angstrom.parse_</code> function, the <code>Buf_read.parse</code> function thinks I want to read a whole stream to end of input.
</p>

<p>
A snippet of the source code:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a7601f;">parse</span> ?<span style="color: #007a9f;">initial_size</span> ~<span style="color: #007a9f;">max_size</span> <span style="color: #007a9f;">p</span> <span style="color: #007a9f;">flow</span> =
  <span style="color: #000000; font-weight: bold;">let</span> <span style="color: #007a9f;">buf</span> = of_flow flow ?initial_size ~max_size <span style="color: #000000; font-weight: bold;">in</span>
  format_errors (p &lt;* end_of_input) buf
  <span style="color: #8f6f4a; font-style: italic;">(*               </span><span style="color: #8f6f4a; font-style: italic;">^^^^^^^^^^^^^^^           </span>
<span style="color: #8f6f4a; font-style: italic;">                    0_0 nice (not)</span><span style="color: #8f6f4a; font-style: italic;">        *)</span>
</pre>
</div>

<p>
So I had to rewrite this function myself in a form similar to <code>Angstrom.Consume.Prefix</code>.
</p>
</div>

<ul class="org-ul">
