2024.08.20.org
**** Is it a signed or unsigned integer? 

~BE.uint16~ and other similar functions are *signed int* even though they have the prefix ~u~ in the name for some reason.

**** And a few other differences

- ~Angstrom.advance~ is ~skip~
- ~Angstrom.pos~ is ~consumed_bytes~

*** P.S.

Thanks for your attention!
      



* GitHub - meta-introspector/ocaml-libppx-import-yojson-introspector: Using libppx, ppx_import, reflect over ast using
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/github-meta-introspector-ocaml-libppx-import-yojson-introspector-using-libppx-ppx-import-reflect-over-ast-using/15151/1

** Jim Dupont announced


Here is a working first version (with warts) of a ppxlib to yojson converter,
am still testing it but the hello world is working, I have tried multiple times to get this to work, 
and finally settled on the import route to override the type system.
code here:
https://github.com/meta-introspector/ocaml-libppx-import-yojson-introspector

example snippet

#+begin_example
{
  "pexp_desc": [
    "Pexp_constant",
    [
      "Pconst_string",
      "Hello, World!"
    ]
  ]
}
#+end_example
      



* Dune Developer Preview Updates
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160/1

** ostera announced


Just wanted to share some of the work the Dune has been up to lately re: the Developer Preview we announced [[https://discuss.ocaml.org/t/ocaml-platform-newsletter-march-may-2024/14765][here]] :) – we'll be using this thread to share more updates as things go.

As always, we hold our Dune Developer meetings in public and you're more than welcome to subscribe to our public Calendar ([[https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com&ctz=Europe%2FStockholm][Google]], [[https://calendar.google.com/calendar/ical/c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com/public/basic.ics][iCal]])

