2024.08.20.html
<li><a id="orgcd97b93"></a>Is it a signed or unsigned integer?<br />
<div class="outline-text-5" id="text-orgcd97b93">
<p>
<code>BE.uint16</code> and other similar functions are <b>signed int</b> even though they have the prefix <code>u</code> in the name for some reason.
</p>
</div>
</li>

<li><a id="org84f277f"></a>And a few other differences<br />
<div class="outline-text-5" id="text-org84f277f">
<ul class="org-ul">
<li><code>Angstrom.advance</code> is <code>skip</code></li>
<li><code>Angstrom.pos</code> is <code>consumed_bytes</code></li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org4f41e3e" class="outline-4">
<h4 id="org4f41e3e">P.S.</h4>
<div class="outline-text-4" id="text-org4f41e3e">
<p>
Thanks for your attention!
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">GitHub - meta-introspector/ocaml-libppx-import-yojson-introspector: Using libppx, ppx_import, reflect over ast using</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/github-meta-introspector-ocaml-libppx-import-yojson-introspector-using-libppx-ppx-import-reflect-over-ast-using/15151/1">https://discuss.ocaml.org/t/github-meta-introspector-ocaml-libppx-import-yojson-introspector-using-libppx-ppx-import-reflect-over-ast-using/15151/1</a>
</p>
</div>

<div id="outline-container-org0b53b4a" class="outline-3">
<h3 id="org0b53b4a">Jim Dupont announced</h3>
<div class="outline-text-3" id="text-org0b53b4a">
<p>
Here is a working first version (with warts) of a ppxlib to yojson converter,
am still testing it but the hello world is working, I have tried multiple times to get this to work, 
and finally settled on the import route to override the type system.
code here:
<a href="https://github.com/meta-introspector/ocaml-libppx-import-yojson-introspector">https://github.com/meta-introspector/ocaml-libppx-import-yojson-introspector</a>
</p>

<p>
example snippet
</p>

<pre class="example" id="orgbee5583">
{
  "pexp_desc": [
    "Pexp_constant",
    [
      "Pconst_string",
      "Hello, World!"
    ]
  ]
}
</pre>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Dune Developer Preview Updates</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160/1">https://discuss.ocaml.org/t/ann-dune-developer-preview-updates/15160/1</a>
</p>
</div>

<div id="outline-container-org1084cf0" class="outline-3">
<h3 id="org1084cf0">ostera announced</h3>
<div class="outline-text-3" id="text-org1084cf0">
<p>
Just wanted to share some of the work the Dune has been up to lately re: the Developer Preview we announced <a href="https://discuss.ocaml.org/t/ocaml-platform-newsletter-march-may-2024/14765">here</a> :) – we'll be using this thread to share more updates as things go.
</p>

<p>
As always, we hold our Dune Developer meetings in public and you're more than welcome to subscribe to our public Calendar (<a href="https://calendar.google.com/calendar/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com&amp;ctz=Europe%2FStockholm">Google</a>, <a href="https://calendar.google.com/calendar/ical/c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319%40group.calendar.google.com/public/basic.ics">iCal</a>)
</p>
</div>
