2024.08.20.org
*** Getting ready for the Public Beta

As we prepare for the public beta, we're ramping up the DX interviews and ensuring the first few users will have a fun, productive experience with the developer preview.

#+begin_quote
:inbox_tray: If you signed up for the Dev Preview back in May, check your inbox for a link and instructions to schedule your DX interview with us.
#+end_quote

Here's a sample video ([[https://mas.to/deck/@leostera/112988841207690720][Mastodon]] or [[https://x.com/leostera/status/1825519465527673238][X]]) where you can see me building the Riot project on a machine that does not have OCaml installed. It is pretty neat!

Seriously, big shoutout to the Dune team at Tarides[0] who have been doing a phenomenal job :clap: :sparkles: :camel: 

So here's what getting started with OCaml looks like today with the Dune Developer Preview as of today (August 19 2024):

1. get ~dune~ from our binary distribution – we'll soon make this public!
2. run ~dune pkg lock~ in your favorite project
3. run ~dune build~

That's it. No need to install anything else, Dune will see that lock file, fetch, and build all necessary dependencies.

#+begin_quote
:world_map: These are some strong step towards the [[https://ocaml.org/tools/platform-roadmap][OCaml Platform vision for 2026]], that we are actively working towards. If you have any thoughts or feedback please let me know!
#+end_quote

There are more improvements coming that will help remove friction to get started and creating a delightful experience. Both of these things we strongly believe will help onboard new users to the OCaml world.

Here's a few in the works:

- *Various DX improvements* – from new outputs to simplified workflows, we want to make using Dune just delightful.
- *Bundled support for dev tools* (ocalmformat, odoc, lsp) – the default toolset will be available without any extra steps! just call ~dune fmt~, and it works. No need to manually install anything else.
- *Automatic dependency locking* – when building, and even on watch mode, Dune will lock your dependencies by default and keep the lock up to date.
- *Cross-project Caching* – by default we'll enabled a local Dune cache that across the system, so you never rebuild the same dependency even across projects.
- *Signed binaries with certificates of origin* – we care deeply about security and want to make sure that any binary we ship will be easily verified and tracked back to its sources.

Stay tuned! :wave: 

PS: here's a longer video ([[https://mas.to/deck/@leostera/112988880290815356][Mastodon]], [[https://x.com/leostera/status/1825519469759812062][X]]) showing you the setup for OCaml from zero, creating a new project, and adding a dependency, all within ~5 minutes

[0] @emillon @Leonidas @gridbugs @tmattio. Ambre Shumay, Alpha Diallo, Etienne Marais
      



* Ppxlib dev meetings
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/ppxlib-dev-meetings/12441/29

** Nathan Rebours announced


This month's meeting is scheduled for tomorrow, [date=2024-08-20 time=17:00:00 timezone="Europe/London"]!

The meeting agenda thus far is to discuss the following:

- *5.2 Bump Progess*
    - Auto-generate AST pattern code and labelled arguments (e.g. ~value_binding ~constraint_:none~ but no positional argument?)
    - ~Ast_helper.Exp.function_~ deprecation
    - [[https://github.com/patricoferris/opam-ppxlib-repository][opam-repository overlay for 5.2 AST bump]]
- *Issues in migrations*
    - Bumping the AST has uncovered issues in migrating code up and down the internal ppxlib ASTs -- would be good to discuss this and also how to mitigate this going forward. 
- *Documentation*
    - Great user feedback from [[https://discuss.ocaml.org/t/ppxlib-getting-the-original-definition-of-typ-constr-like-type-declaration-from-core-type-of-ptyp-constr/15110][Ppxlib: Getting the original definition of ~typ_constr~ like ~type_declaration~ from ~core_type~ of ~ptyp_constr~]] which we should take onboard and work into https://github.com/ocaml-ppx/ppxlib/issues/324 
- *Some carry over items from last month*
    - In general what is the medium term goals for ppxlib? Mostly maintenance and bumping the AST/keeping up with compiler releases?

The meeting will be hosted on google meet here: https://meet.google.com/yxw-ejnu-cju

Everyone is very welcome to join! :camel:
      



* Pragmatic Category Theory: Part 2 published!
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/new-part-pragmatic-category-theory-part-2-published/15056/6

