2024.08.20.html

<div id="outline-container-org5383d60" class="outline-4">
<h4 id="org5383d60">Getting ready for the Public Beta</h4>
<div class="outline-text-4" id="text-org5383d60">
<p>
As we prepare for the public beta, we're ramping up the DX interviews and ensuring the first few users will have a fun, productive experience with the developer preview.
</p>

<blockquote>
<p>
:inbox_tray: If you signed up for the Dev Preview back in May, check your inbox for a link and instructions to schedule your DX interview with us.
</p>
</blockquote>

<p>
Here's a sample video (<a href="https://mas.to/deck/@leostera/112988841207690720">Mastodon</a> or <a href="https://x.com/leostera/status/1825519465527673238">X</a>) where you can see me building the Riot project on a machine that does not have OCaml installed. It is pretty neat!
</p>

<p>
Seriously, big shoutout to the Dune team at Tarides[0] who have been doing a phenomenal job :clap: :sparkles: :camel: 
</p>

<p>
So here's what getting started with OCaml looks like today with the Dune Developer Preview as of today (August 19 2024):
</p>

<ol class="org-ol">
<li>get <code>dune</code> from our binary distribution – we'll soon make this public!</li>
<li>run <code>dune pkg lock</code> in your favorite project</li>
<li>run <code>dune build</code></li>
</ol>

<p>
That's it. No need to install anything else, Dune will see that lock file, fetch, and build all necessary dependencies.
</p>

<blockquote>
<p>
:world_map: These are some strong step towards the <a href="https://ocaml.org/tools/platform-roadmap">OCaml Platform vision for 2026</a>, that we are actively working towards. If you have any thoughts or feedback please let me know!
</p>
</blockquote>

<p>
There are more improvements coming that will help remove friction to get started and creating a delightful experience. Both of these things we strongly believe will help onboard new users to the OCaml world.
</p>

<p>
Here's a few in the works:
</p>

<ul class="org-ul">
<li><b>Various DX improvements</b> – from new outputs to simplified workflows, we want to make using Dune just delightful.</li>
<li><b>Bundled support for dev tools</b> (ocalmformat, odoc, lsp) – the default toolset will be available without any extra steps! just call <code>dune fmt</code>, and it works. No need to manually install anything else.</li>
<li><b>Automatic dependency locking</b> – when building, and even on watch mode, Dune will lock your dependencies by default and keep the lock up to date.</li>
<li><b>Cross-project Caching</b> – by default we'll enabled a local Dune cache that across the system, so you never rebuild the same dependency even across projects.</li>
<li><b>Signed binaries with certificates of origin</b> – we care deeply about security and want to make sure that any binary we ship will be easily verified and tracked back to its sources.</li>
</ul>

<p>
Stay tuned! :wave: 
</p>

<p>
PS: here's a longer video (<a href="https://mas.to/deck/@leostera/112988880290815356">Mastodon</a>, <a href="https://x.com/leostera/status/1825519469759812062">X</a>) showing you the setup for OCaml from zero, creating a new project, and adding a dependency, all within ~5 minutes
</p>

<p>
[0] @emillon @Leonidas @gridbugs @tmattio. Ambre Shumay, Alpha Diallo, Etienne Marais
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Ppxlib dev meetings</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ppxlib-dev-meetings/12441/29">https://discuss.ocaml.org/t/ppxlib-dev-meetings/12441/29</a>
</p>
</div>

<div id="outline-container-orgb9ffc02" class="outline-3">
<h3 id="orgb9ffc02">Nathan Rebours announced</h3>
<div class="outline-text-3" id="text-orgb9ffc02">
<p>
This month's meeting is scheduled for tomorrow, [date=2024-08-20 time=17:00:00 timezone="Europe/London"]!
</p>

<p>
The meeting agenda thus far is to discuss the following:
</p>

<ul class="org-ul">
<li><b>5.2 Bump Progess</b>
<ul class="org-ul">
<li>Auto-generate AST pattern code and labelled arguments (e.g. <code>value_binding ~constraint_:none</code> but no positional argument?)</li>
<li><code>Ast_helper.Exp.function_</code> deprecation</li>
<li><a href="https://github.com/patricoferris/opam-ppxlib-repository">opam-repository overlay for 5.2 AST bump</a></li>
</ul></li>
<li><b>Issues in migrations</b>
<ul class="org-ul">
<li>Bumping the AST has uncovered issues in migrating code up and down the internal ppxlib ASTs &#x2013; would be good to discuss this and also how to mitigate this going forward.</li>
</ul></li>
<li><b>Documentation</b>
<ul class="org-ul">
<li>Great user feedback from <a href="https://discuss.ocaml.org/t/ppxlib-getting-the-original-definition-of-typ-constr-like-type-declaration-from-core-type-of-ptyp-constr/15110">Ppxlib: Getting the original definition of <code>typ_constr</code> like <code>type_declaration</code> from <code>core_type</code> of <code>ptyp_constr</code></a> which we should take onboard and work into <a href="https://github.com/ocaml-ppx/ppxlib/issues/324">https://github.com/ocaml-ppx/ppxlib/issues/324</a></li>
</ul></li>
<li><b>Some carry over items from last month</b>
<ul class="org-ul">
<li>In general what is the medium term goals for ppxlib? Mostly maintenance and bumping the AST/keeping up with compiler releases?</li>
</ul></li>
</ul>

<p>
The meeting will be hosted on google meet here: <a href="https://meet.google.com/yxw-ejnu-cju">https://meet.google.com/yxw-ejnu-cju</a>
</p>

<p>
Everyone is very welcome to join! :camel:
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">Pragmatic Category Theory: Part 2 published!</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/new-part-pragmatic-category-theory-part-2-published/15056/6">https://discuss.ocaml.org/t/new-part-pragmatic-category-theory-part-2-published/15056/6</a>
</p>
</div>
