2024.08.20.html

<div id="outline-container-orged346b0" class="outline-3">
<h3 id="orged346b0">Dmitrii Kovanikov announced</h3>
<div class="outline-text-3" id="text-orged346b0">
<p>
I just published <a href="https://dev.to/chshersh/pragmatic-category-theory-part-2-composing-semigroups-87">the second part</a> of my series, so I updated the topic.
</p>

<p>
Let me know when notifications become too noisy :slight_smile:
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">Dune dev meeting on 2024-08-21, 10am CEST</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-dev-meeting-on-2024-08-21-10am-cest/15166/1">https://discuss.ocaml.org/t/ann-dune-dev-meeting-on-2024-08-21-10am-cest/15166/1</a>
</p>
</div>

<div id="outline-container-org03bbf76" class="outline-3">
<h3 id="org03bbf76">Steve Sherratt announced</h3>
<div class="outline-text-3" id="text-org03bbf76">
<p>
Hi! The next public dune dev meeting will be held on 2024-08-21, 10am CEST. Please feel free to let me know any topics you'd like us to discuss and I'll update <a href="https://github.com/ocaml/dune/wiki/dev-meeting-2024-08-21">the meeting notes</a>. The zoom link for the meeting is: <a href="https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09">https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09</a>
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">Other OCaml News</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org54285cb" class="outline-3">
<h3 id="org54285cb">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org54285cb">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://blog.robur.coop/articles/tar-release.html">The new Tar release, a retrospective</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgae87327" class="outline-2">
<h2 id="orgae87327">Old CWN</h2>
<div class="outline-text-2" id="text-orgae87327">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgaf22722">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
