2024.08.20.txt


Dmitrii Kovanikov announced
───────────────────────────

  I just published [the second part] of my series, so I updated the
  topic.

  Let me know when notifications become too noisy :slight_smile:


[the second part]
<https://dev.to/chshersh/pragmatic-category-theory-part-2-composing-semigroups-87>


Dune dev meeting on 2024-08-21, 10am CEST
═════════════════════════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-dune-dev-meeting-on-2024-08-21-10am-cest/15166/1>


Steve Sherratt announced
────────────────────────

  Hi! The next public dune dev meeting will be held on 2024-08-21, 10am
  CEST. Please feel free to let me know any topics you'd like us to
  discuss and I'll update [the meeting notes]. The zoom link for the
  meeting is:
  <https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09>


[the meeting notes]
<https://github.com/ocaml/dune/wiki/dev-meeting-2024-08-21>


Other OCaml News
════════════════

From the ocaml.org blog
───────────────────────

  Here are links from many OCaml blogs aggregated at [the ocaml.org
  blog].

  • [The new Tar release, a retrospective]


[the ocaml.org blog] <https://ocaml.org/blog/>

[The new Tar release, a retrospective]
<https://blog.robur.coop/articles/tar-release.html>


Old CWN
═══════

  If you happen to miss a CWN, you can [send me a message] and I'll mail
  it to you, or go take a look at [the archive] or the [RSS feed of the
  archives].

  If you also wish to receive it every week by mail, you may subscribe
  to the [caml-list].

  [Alan Schmitt]


[send me a message] <mailto:alan.schmitt@polytechnique.org>

[the archive] <https://alan.petitepomme.net/cwn/>

[RSS feed of the archives] <https://alan.petitepomme.net/cwn/cwn.rss>

[caml-list] <https://sympa.inria.fr/sympa/info/caml-list>

[Alan Schmitt] <https://alan.petitepomme.net/>
